kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
            if (g_clockout_status)
            {
                g_clockout_status = 0;
            }
            else
            {
                g_clockout_status = 1;
            }
            PCF8563_ClockOutForTrimmer(g_clockout_status);
            ESP_LOGI(TAG, "PCF8563_ClockOutForTrimmer: %d", g_clockout_status);
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

        }

        vTaskDelay(pdMS_TO_TICKS(80));
    }
    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_INTERNAL_BUTTON_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT
// SELECT GPIO_NUM_XX
TaskHandle_t xExternalButton;
Button_External_t* button_ext1;
static void vExternal_button_task(void* pvParameters) {
    ESP_LOGD(TAG, "start EXTERNAL Button");

    Button_External_Init();
    if (Button_External_Enable(BUTTON_EXT1_GPIO_PIN, BUTTON_EXTERNAL_ACTIVE_LOW) == ESP_OK) {
        button_ext1 = Button_External_Attach(BUTTON_EXT1_GPIO_PIN, BUTTON_EXTERNAL_ACTIVE_LOW);
    }
    while(1){
        if (Button_External_WasPressed(button_ext1)) {
            ESP_LOGI(TAG, "BUTTON EXT1 PRESSED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(true);
#endif
        }
        if (Button_External_WasReleased(button_ext1)) {
            ESP_LOGI(TAG, "BUTTON EXT1 RELEASED!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#endif
        }
        if (Button_External_WasLongPress(button_ext1, pdMS_TO_TICKS(1000))) { // 1Sec
            ESP_LOGI(TAG, "BUTTON EXT1 LONGPRESS!");
#if CONFIG_SOFTWARE_UI_SUPPORT
            ui_button_label_update(false);
#endif
        }

        vTaskDelay(pdMS_TO_TICKS(80));
    }
    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_EXTERNAL_BUTTON_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT
TaskHandle_t xExternalI2c;
i2c_master_bus_handle_t i2c0_master_bus_handle;
void vExternal_i2c_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL I2C");
    esp_err_t ret = ESP_OK;
    i2c_master_bus_config_t i2c_mst_config_0 = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C0_MASTER_PORT,
        .scl_io_num = I2C0_MASTER_SCL_PIN,
        .sda_io_num = I2C0_MASTER_SDA_PIN,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    ret = i2c_new_master_bus(&i2c_mst_config_0, &i2c0_master_bus_handle);
    vTaskDelay( pdMS_TO_TICKS(100) );
    if (ret == ESP_OK)
    {
        ESP_LOGD(TAG, "i2c_new_master_bus is OK.");
    }
    else
    {
        ESP_LOGE(TAG, "I2C i2c_new_master_bus error");
    }

#if CONFIG_SOFTWARE_SENSOR_ADT7410
    bool _isSensorAdt7410 = false;
    ret = Adt7410_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Adt7410_Init() is OK!");
        _isSensorAdt7410 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Adt7410_Init Error");
        g_sensor_mode -= 1;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BMP280
    bool _isSensorBmp280 = false;
    ret = Bmp280_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Bmp280_Init() is OK!");
        _isSensorBmp280 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Bmp280_Init Error");
        g_sensor_mode -= 4;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_QMP6988
    bool _isSensorQmp6988 = false;
    ret = Qmp6988_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Qmp6988_Init() is OK!");
        _isSensorQmp6988 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Qmp6988_Init Error");
        g_sensor_mode -= 4;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_DPS310
    bool _isSensorDps310 = false;
    ret = Dps310_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Dps310_Init() is OK!");
        _isSensorDps310 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Dps310_Init Error");
        g_sensor_mode -= 4;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BME680
    bool _isSensorBme680 = false;
    ret = Esp32_Bme680_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Esp32_Bme680_Init() is OK!");
        _isSensorBme680 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Esp32_Bme680_Init Error");
        g_sensor_mode -= 7;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_SHT3X
    bool _isSensorSht3x = false;
    ret = Sht3x_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Sht3x_Init() is OK!");
        _isSensorSht3x = true;
    }
    else
    {
        ESP_LOGE(TAG, "Sht3x_Init Error");
        g_sensor_mode -= 3;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_SHT4X
    bool _isSensorSht4x = false;
    ret = Sht4x_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Sht4x_Init() is OK!");
        _isSensorSht4x = true;
        g_isSensorSht4x = true;
    }
    else
    {
        ESP_LOGE(TAG, "Sht4x_Init Error");
        g_sensor_mode -= 3;
    }
#endif
#if CONFIG_SOFTWARE_SENSOR_SCD30
    bool _isSensorScd30 = false;
    ret = Scd30_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "Scd30_Init() is OK!");
        _isSensorScd30 = true;
    }
    else
    {
        ESP_LOGE(TAG, "Scd30_Init Error");
        g_sensor_mode -= 11;
    }
#endif

#if CONFIG_SOFTWARE_SENSOR_BH1750
    bool _isSensorBh1750 = false;
    ret = BH1750_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "BH1750_Init() is OK!");
        _isSensorBh1750 = true;

        ret = BH1750_SetMode(BH1750_CONTINUOUSLY_H_RESOLUTION_MODE);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "BH1750_SetMode Error");
        }
    }
    else
    {
        ESP_LOGE(TAG, "BH1750_Init Error");
        g_sensor_mode -= 16;
    }

#endif

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
    ret = PCF8563_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "PCF8563_Init() is OK!");

        RtcInterruptInit();
        RtcStartClockInit();
    }
    else
    {
        ESP_LOGE(TAG, "PCF8563_Init Error");
    }
#endif

#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
    ret = HT16K33_Init(i2c0_master_bus_handle);
    if (ret == ESP_OK) {
        ESP_LOGD(TAG, "HT16K33_Init() is OK!");

#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_7SEG
        SevenSegInit();
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_7SEG
#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_DOTMATRIX
        DotMatrix_SandClock();
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_DOTMATRIX_
    }
    else
    {
        ESP_LOGE(TAG, "HT16K33_Init Error");
    }
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT

    while (1) {
#if CONFIG_SOFTWARE_SENSOR_ADT7410
        if (_isSensorAdt7410) {
            g_temperature = Adt7410_getTemperature_13bit();
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_BMP280
        if (_isSensorBmp280) {
            g_pressure = Bmp280_getPressure() / 100.0;
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_QMP6988
        if (_isSensorQmp6988) {
            g_pressure = Qmp6988_CalcPressure() / 100.0;
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_DPS310
        if (_isSensorDps310) {
            if (Dps310_Read() == ESP_OK) {
                g_pressure = Dps310_GetPressure() / 100.0;
            }
        }
#endif

