kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
#if CONFIG_SOFTWARE_SENSOR_BME680
        if (_isSensorBme680) {
            if (Esp32_Bme680_read_sensor_data() == 0) {
                g_temperature = Esp32_Bme680_get_temperature();
                g_humidity = Esp32_Bme680_get_humidity();
                g_pressure = Esp32_Bme680_get_pressure() / 100.0;
//                g_gas = Esp32_Bme680_get_gas() / 1000.0;
            }
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_SHT3X
        if (_isSensorSht3x) {
            ret = Sht3x_Read();
            if (ret == ESP_OK) {
                vTaskDelay( pdMS_TO_TICKS(100) );
                g_temperature = Sht3x_GetTemperature();
                g_humidity = Sht3x_GetHumidity();
            }
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_SHT4X
        if (_isSensorSht4x) {
            ret = Sht4x_Read();
            if (ret == ESP_OK) {
                vTaskDelay( pdMS_TO_TICKS(100) );
                g_temperature = Sht4x_GetTemperature();
                g_humidity = Sht4x_GetHumidity();
            }
        }
#endif
#if CONFIG_SOFTWARE_SENSOR_SCD30
        if (_isSensorScd30) {
            ret = Scd30_Read();
            if (ret == ESP_OK) {
                vTaskDelay( pdMS_TO_TICKS(100) );
                g_temperature = Scd30_GetTemperature();
                g_humidity = Scd30_GetHumidity();
                g_co2 = Scd30_GetIntCo2();
            }
        }
#endif

#if CONFIG_SOFTWARE_SENSOR_BH1750
        if (_isSensorBh1750) {
            uint16_t tmp_lux = 0;
            tmp_lux = 0;
            tmp_lux = BH1750_GetLUX();
            if (tmp_lux != 0)
            {
                g_lux = tmp_lux;
            } else {
                ESP_LOGE(TAG, "BH1750_GetLUX is return lux = 0");
                vTaskDelay( pdMS_TO_TICKS(1000) );
            }
        }
#endif
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_I2C_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT
#if CONFIG_SOFTWARE_SENSOR_MHZ19C
bool g_mhz19cInitialized = false;
TaskHandle_t xExternalUart;
void vExternal_uart_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL UART");
    esp_err_t ret = ESP_OK;
    ret = Mhz19c_Init(UART1_PORT, UART1_TXD_PIN, UART1_RXD_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE, UART1_RATE_BAUD);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Mhz19c_Init Error");
        g_sensor_mode -= 8;
        vTaskDelay( pdMS_TO_TICKS(500) );
        vTaskDelete(NULL);
    }
    while (!g_mhz19cInitialized)
    {
        Mhz19c_SetAutoCalibration(UART1_PORT, false);
        vTaskDelay( pdMS_TO_TICKS(5000) );

        g_co2 = Mhz19c_GetCO2Concentration(UART1_PORT);
//        if (g_co2 != 0)
        if (g_co2 >= 400)
        {
            g_mhz19cInitialized = true;
        }
        ESP_LOGE(TAG, "Mhz19c_SetAutoCalibration retry");
        Mhz19c_SetAutoCalibration(UART1_PORT, true);
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
    ESP_LOGD(TAG, "Mhz19c_Init() is OK!");

    int tmp_co2 = 0;
    while (1) {
        tmp_co2 = 0;
        tmp_co2 = Mhz19c_GetCO2Concentration(UART1_PORT);
        if (tmp_co2 != 0)
        {
            g_co2 = tmp_co2;
        } else {
            ESP_LOGE(TAG, "Mhz19c_GetCO2Concentration is return co2 = 0");
            vTaskDelay( pdMS_TO_TICKS(1000) );
        }

       vTaskDelay( pdMS_TO_TICKS(5000) );
    }
}
#endif //CONFIG_SOFTWARE_SENSOR_MHZ19C
#endif //CONFIG_SOFTWARE_EXTERNAL_UART_SUPPORT

#if CONFIG_SOFTWARE_ESPTIMER_SUPPORT
TaskHandle_t xTimer;
static uint32_t g_CountDown = 0;
static uint32_t g_MaxCountDown = (1) * 60;
static void periodic_timer_callback(void* arg);
static void periodic_timer_callback(void* arg)
{
    int64_t time_since_boot = esp_timer_get_time();
    ESP_LOGI(TAG, "Periodic timer called, time since boot: %lld us", time_since_boot);
    if (g_CountDown > 0)
    {
        g_CountDown--;
    }
    else
    {
        g_CountDown = g_MaxCountDown;
    }
    ESP_LOGI(TAG, "Count Down: %ld", g_CountDown);
}
static void vTimer_task(void* arg)
{
    g_CountDown = g_MaxCountDown;
    const esp_timer_create_args_t periodic_timer_args = {
            .callback = &periodic_timer_callback,
            .name = "periodic"
    };

    esp_timer_handle_t periodic_timer;
    ESP_ERROR_CHECK(esp_timer_create(&periodic_timer_args, &periodic_timer));
    ESP_ERROR_CHECK(esp_timer_start_periodic(periodic_timer, 1000000));

    vTaskDelete(NULL);
}
#endif //CONFIG_SOFTWARE_ESPTIMER_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
TaskHandle_t xClock;
static QueueHandle_t gpio_evt_clock_queue = NULL;
static QueueHandle_t gpio_evt_int_queue = NULL;
static void IRAM_ATTR gpio_clock_isr_handler(void* arg)
{
    uint32_t gpio_num = (uint32_t) arg;
    xQueueSendFromISR(gpio_evt_clock_queue, &gpio_num, NULL);
}

static void IRAM_ATTR gpio_int_isr_handler(void* arg)
{
    uint32_t gpio_num = (uint32_t) arg;
    xQueueSendFromISR(gpio_evt_int_queue, &gpio_num, NULL);
}

static void gpio_clock_task(void* arg)
{
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
    bool bTm1637Init = false;
    DigitDisplay_t* digitdisplay_1;
    uint8_t listDisp_1[XDIGIT_DISPLAY_DIGIT_COUNT];
    Tm1637_Init();
    if (Tm1637_Enable(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN) == ESP_OK) {
        digitdisplay_1 = Tm1637_Attach(XDIGIT_DISPLAY_CLK_EXT1_GPIO_PIN, XDIGIT_DISPLAY_DATA_EXT1_GPIO_PIN, BRIGHT_DARKEST, XDIGIT_DISPLAY_DIGIT_COUNT);
        bTm1637Init = true;
        Tm1637_ClearDisplay(digitdisplay_1);
    } else {
        ESP_LOGE(TAG, "Digit Display Tm1637_Enable Error");
    }
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
        bool bHt16K33Init = true;
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
    uint8_t backupHour = 0;
    uint8_t backupMinute = 0;
    uint8_t backupSecond = 0;
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
    uint32_t io_num;
    for (;;) {
        if (xQueueReceive(gpio_evt_clock_queue, &io_num, portMAX_DELAY)) {
#if CONFIG_SOFTWARE_ESPTIMER_SUPPORT
            int64_t time_since_boot = esp_timer_get_time();
            ESP_LOGI(TAG, "gpio_evt_clock called, time since boot: %lld us", time_since_boot);
#else
            ESP_LOGI(TAG, "CLOCK GPIO[%"PRIu32"] intr, val: %d", io_num, gpio_get_level(io_num));
            rtc_date_t rtcdate;
            PCF8563_GetTime(&rtcdate);
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
            if (bTm1637Init == true)
            {
                uint8_t hour10 = rtcdate.hour / 10;
                uint8_t hour01 = ( rtcdate.hour % 10 );
                uint8_t minute10 = rtcdate.minute / 10;
                uint8_t minute01 = ( rtcdate.minute % 10 );
                uint8_t second10 = rtcdate.second / 10;
                uint8_t second01 = ( rtcdate.second % 10 );
                listDisp_1[0] = hour10;
                listDisp_1[1] = hour01;
                listDisp_1[2] = minute10;
                listDisp_1[3] = minute01;
                listDisp_1[4] = second10;
                listDisp_1[5] = second01;
//                Tm1637_DisplayAll(digitdisplay_1, listDisp_1);
                Tm1637_DisplayClockDot(digitdisplay_1, listDisp_1);
            }
            else
            {
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
            if (bHt16K33Init == true)
            {
                uint8_t clockArray[5] = { 0 };
//                HT16K33_ParseTimeToDigitClockAndPulse(rtcdate.hour, rtcdate.minute, rtcdate.second, clockArray, sizeof(clockArray)/sizeof(uint8_t));
                if (backupSecond != rtcdate.second)
                {
                    HT16K33_ParseTimeToSecondAndPulse(rtcdate.second, &clockArray[4], 1);
                    if (clockArray[4] == 0)
                    {
                        HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM4, HT16K33_COM_SECOND_HALF, convertCharToSegments(' '));
                    }
                    else
                    {
                        HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM4, HT16K33_COM_SECOND_HALF, convertCharToSegments(':'));
                    }
                    backupSecond = rtcdate.second;
                }
                if (backupMinute != rtcdate.minute)
                {
                    HT16K33_ParseTimeToMinute(rtcdate.minute, &clockArray[2], 2);
                    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM3, HT16K33_COM_SECOND_HALF, clockArray[3]);
                    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM2, HT16K33_COM_SECOND_HALF, clockArray[2]);

#if CONFIG_SOFTWARE_SENSOR_SHT4X_SUPPORT || CONFIG_SOFTWARE_SENSOR_SHT4X
                    if (g_isSensorSht4x) {
                        uint8_t temperatureArray[3] = { 0 };
                        uint8_t humidityArray[3] = { 0 };
                        esp_err_t ret = Sht4x_Read();
                        if (ret == ESP_OK) {
                            vTaskDelay( pdMS_TO_TICKS(20) );
                            HT16K33_ParseFloatToDigit2Point1(Sht4x_GetTemperature(), temperatureArray, 3);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM0, HT16K33_COM_FIRST_HALF, temperatureArray[0]);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM1, HT16K33_COM_FIRST_HALF, temperatureArray[1]);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM2, HT16K33_COM_FIRST_HALF, temperatureArray[2]);
                            HT16K33_ParseFloatToDigit2Point1(Sht4x_GetHumidity(), humidityArray, 3);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM4, HT16K33_COM_FIRST_HALF, humidityArray[0]);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM5, HT16K33_COM_FIRST_HALF, humidityArray[1]);
                            HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM6, HT16K33_COM_FIRST_HALF, humidityArray[2]);
                        }
                    }
#endif //CONFIG_SOFTWARE_SENSOR_SHT4X_SUPPORT

                    backupMinute = rtcdate.minute;
                }
                if (backupHour != rtcdate.hour)
                {
                    HT16K33_ParseTimeToHour(rtcdate.hour, &clockArray[0], 2);
                    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM1, HT16K33_COM_SECOND_HALF, clockArray[1]);
                    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_COM0, HT16K33_COM_SECOND_HALF, clockArray[0]);
                    backupHour = rtcdate.hour;
                }
            }
            else
            {
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
                ESP_LOGI(TAG, "%04d/%02d/%02d %02d:%02d:%02d", rtcdate.year, rtcdate.month, rtcdate.day, rtcdate.hour, rtcdate.minute, rtcdate.second);
#if CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
            }
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
            }
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
#endif //CONFIG_SOFTWARE_ESPTIMER_SUPPORT
        }
    }
}

static void gpio_int_task(void* arg)
{
    uint32_t io_num;
    for (;;) {
        if (xQueueReceive(gpio_evt_int_queue, &io_num, portMAX_DELAY)) {
            ESP_LOGI(TAG, "INT GPIO[%"PRIu32"] intr, val: %d", io_num, gpio_get_level(io_num));
        }
    }
}

void RtcInterruptInit()
{
    ESP_LOGI(TAG, "start RtcInterruptInit()");

    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.pin_bit_mask = ((1ULL<<PCF8563__CLOCK_PIN) | (1ULL<<PCF8563__INT_PIN));
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    gpio_evt_clock_queue = xQueueCreate(10, sizeof(uint32_t));
    gpio_evt_int_queue = xQueueCreate(10, sizeof(uint32_t));
    xTaskCreate(gpio_clock_task, "gpio_clock_task", 4096 * 1, NULL, 10, NULL);
    xTaskCreate(gpio_int_task, "gpio_int_task", 4096 * 1, NULL, 10, NULL);

    ESP_ERROR_CHECK(gpio_install_isr_service(0));
    ESP_ERROR_CHECK(gpio_isr_handler_add(PCF8563__CLOCK_PIN, gpio_clock_isr_handler, (void*) PCF8563__CLOCK_PIN));
    ESP_ERROR_CHECK(gpio_isr_handler_add(PCF8563__INT_PIN, gpio_int_isr_handler, (void*) PCF8563__INT_PIN));
    ESP_ERROR_CHECK(gpio_intr_enable(PCF8563__CLOCK_PIN));
    ESP_ERROR_CHECK(gpio_intr_enable(PCF8563__INT_PIN));
    ESP_ERROR_CHECK(gpio_set_intr_type(PCF8563__CLOCK_PIN, GPIO_INTR_NEGEDGE));
    ESP_ERROR_CHECK(gpio_set_intr_type(PCF8563__INT_PIN, GPIO_INTR_NEGEDGE));

