kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
}

void RtcStartClockInit()
{
    ESP_LOGI(TAG, "start RtcStartClockInit()");
#if CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT

    while (!PCF8563_isInitialized()) {
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }
    g_clockout_status = 1;
    PCF8563_ClockOutForTrimmer(g_clockout_status);
    ESP_LOGI(TAG, "PCF8563_ClockOutForTrimmer: %d", g_clockout_status);

#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_CLOCKOUT_1KHZ_SUPPORT
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT
}

#if CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT
TaskHandle_t xExternalRtc;
static bool g_timeInitialized = false;

static void time_sync_notification_cb(struct timeval *tv)
{
    ESP_LOGD(TAG, "Notification of a time synchronization event");
    g_timeInitialized = true;
}

void vExternal_rtc_task(void *pvParametes)
{
    //PCF8563
    ESP_LOGD(TAG, "start EXTERNAL Rtc");

    // Set timezone to Japan Standard Time
    setenv("TZ", "JST-9", 1);
    tzset();

    ESP_LOGD(TAG, "NTP ServerName:%s", CONFIG_NTP_SERVER_NAME);
    esp_sntp_setservername(0, CONFIG_NTP_SERVER_NAME);

    sntp_set_time_sync_notification_cb(time_sync_notification_cb);

    while (1) {
        if (wifi_isConnected() == ESP_OK) {
            esp_sntp_init();
        } else {
            vTaskDelay( pdMS_TO_TICKS(60000) );
            continue;
        }

        ESP_LOGD(TAG, "Waiting for time synchronization with SNTP server");
        while (!g_timeInitialized)
        {
            vTaskDelay( pdMS_TO_TICKS(5000) );
        }

        time_t now = 0;
        struct tm timeinfo = {0};
        time(&now);
        localtime_r(&now, &timeinfo);
        sprintf(g_lastSyncDatetime,"NTP Update : %04d/%02d/%02d %02d:%02d", timeinfo.tm_year+1900, timeinfo.tm_mon+1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min);
        ESP_LOGI(TAG, "%s", g_lastSyncDatetime);
#if CONFIG_SOFTWARE_UI_SUPPORT
        ui_status_set(g_lastSyncDatetime);
#endif //CONFIG_SOFTWARE_UI_SUPPORT

        if (PCF8563_isInitialized() == true)
        {
            rtc_date_t rtcdate;
            rtcdate.year = timeinfo.tm_year+1900;
            rtcdate.month = timeinfo.tm_mon+1;
            rtcdate.day = timeinfo.tm_mday;
            rtcdate.hour = timeinfo.tm_hour;
            rtcdate.minute = timeinfo.tm_min;
            rtcdate.second = timeinfo.tm_sec;
            PCF8563_SetTime(&rtcdate);
        }

        g_timeInitialized = false;
        esp_sntp_stop();
        vTaskDelay( pdMS_TO_TICKS(CONFIG_NTP_UPDATE_INTERVAL_TIME_MS) );
    }
}
#endif //CONFIG_SOFTWARE_INTERNAL_WIFI_SUPPORT

void vClock_task(void *pvParametes)
{
    //PCF8563
    ESP_LOGD(TAG, "start Clock");
 
    // Set timezone to Japan Standard Time
    setenv("TZ", "JST-9", 1);
    tzset();

    while (!PCF8563_isInitialized()) {
        vTaskDelay( pdMS_TO_TICKS(5000) );
    }

    while (1) {
        rtc_date_t rtcdate;
        PCF8563_GetTime(&rtcdate);
#if CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT
        if (g_clockCurrent != rtcdate.hour) {
            if (rtcdate.hour == 0) { // 0:00
                g_clockCount = 12;
            } else if (rtcdate.hour > 12) { // 13:00-23:00
                g_clockCount = rtcdate.hour - 12;
            } else { // 1:00-12:00
                g_clockCount = rtcdate.hour;
            }
            g_clockCurrent = rtcdate.hour;
            vTaskResume(xSpeaker);
        }
#endif //CONFIG_SOFTWARE_CLOCK_SOUND_SUPPORT
        char str1[30] = {0};
        sprintf(str1,"%04d/%02d/%02d %02d:%02d:%02d", rtcdate.year, rtcdate.month, rtcdate.day, rtcdate.hour, rtcdate.minute, rtcdate.second);
#if CONFIG_SOFTWARE_UI_SUPPORT
        ui_datetime_set(str1);
#else
#if CONFIG_NTP_CLOCK_LOG_ENABLE
    ESP_LOGI(TAG, "%s", str1);
#endif //CONFIG_NTP_CLOCK_LOG_ENABLE
#endif //CONFIG_SOFTWARE_UI_SUPPORT

        vTaskDelay( pdMS_TO_TICKS(990) );
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_RTC_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_DOTMATRIX
void vDotMatrixSandClock_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start DotMatrix_SandClock");

    ht16k33_target targets[] = {
        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL8},
        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW8, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL7},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL8},

        {HT16K33_2nd, HT16K33_ROW7, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL6},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL7},

