kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
        {HT16K33_2nd, HT16K33_ROW6, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL5},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL6},

        {HT16K33_2nd, HT16K33_ROW5, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL4},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL5},

        {HT16K33_2nd, HT16K33_ROW4, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL3},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL4},

        {HT16K33_2nd, HT16K33_ROW3, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL2},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL3},

        {HT16K33_2nd, HT16K33_ROW2, HT16K33_COL1},
        {HT16K33_2nd, HT16K33_ROW1, HT16K33_COL2}
    };

    const uint32_t delay = 900; // 900:179 950:189 1000:199 500:103
    ESP_LOGI(TAG, "DotMatrix_SandClock time start");
    HT16K33_DisplayClear();
    vTaskDelay( pdMS_TO_TICKS(delay) );

    // HT16K33_2nd on
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW2, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW3, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW4, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW5, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW6, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW7, HT16K33_2nd, HT16K33_COL_ALLON);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW8, HT16K33_2nd, HT16K33_COL_ALLON);
    vTaskDelay( pdMS_TO_TICKS(delay) );
    for (uint8_t i = 0; i < sizeof(targets)/sizeof(ht16k33_target); i++)
    {
        uint8_t buf0 = 0;
        uint8_t buf1 = 0;
        uint8_t buf2 = 0;
        HT16K33_ReadRAMRegstoryFromRawDataAt1Byte(targets[i].row, HT16K33_2nd, &buf2);
        HT16K33_DisplayFromRawDataAt1Byte(targets[i].row, HT16K33_2nd, buf2^targets[i].col);
        vTaskDelay( pdMS_TO_TICKS(delay) );

        HT16K33_ReadRAMRegstoryFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_1st, &buf0);
        HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_1st, buf0^HT16K33_COL1);
        vTaskDelay( pdMS_TO_TICKS(delay) );
        HT16K33_ReadRAMRegstoryFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_1st, &buf0);
        HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_1st, buf0^HT16K33_COL1);

        HT16K33_ReadRAMRegstoryFromRawDataAt1Byte(targets[i].row, HT16K33_1st, &buf1);
        HT16K33_DisplayFromRawDataAt1Byte(targets[i].row, HT16K33_1st, buf1|targets[i].col);
        vTaskDelay( pdMS_TO_TICKS(delay) );
    }
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_2nd, HT16K33_COL_ALLOFF);
    HT16K33_DisplayFromRawDataAt1Byte(HT16K33_ROW1, HT16K33_1st, HT16K33_COL_ALLON);
    ESP_LOGI(TAG, "DotMatrix_SandClock time end");

    vTaskDelete(NULL);
}

void DotMatrix_SandClock()
{
    xTaskCreate(vDotMatrixSandClock_task, "vDotMatrixSandClock_task", 4096 * 1, NULL, 10, NULL);
}
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_DOTMATRIX

#if CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_7SEG
void vSevenSeg_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start 7seg");

    while (1) {
        HT16K33_ShowTest();

        vTaskDelay( pdMS_TO_TICKS(1000) );
    }
}

void SevenSegInit()
{
    xTaskCreate(vSevenSeg_task, "vSevenSeg_task", 4096 * 1, NULL, 10, NULL);
}
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_LED_7SEG
#endif //CONFIG_SOFTWARE_EXTERNAL_HT16K33_SUPPORT

#if CONFIG_SOFTWARE_SENSOR_USE_SENSOR
#if (CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
TaskHandle_t xSensorViewer;
void vSensor_Viewer_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start Sensor Viewer");
    vTaskDelay( pdMS_TO_TICKS(10000) );

    #if CONFIG_SOFTWARE_SENSOR_TYPE_TEMPERATURE
    g_sensor_mode += 1;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_HUMIDITY
    g_sensor_mode += 2;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_PRESSURE
    g_sensor_mode += 4;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_CO2
    g_sensor_mode += 8;
    #endif
    #if CONFIG_SOFTWARE_SENSOR_TYPE_LIGHT
    g_sensor_mode += 16;
    #endif

    while (1) {
        ESP_LOGD(TAG, "SENSOR mode %d", g_sensor_mode);
        switch (g_sensor_mode)
        {
        case 1:
            ESP_LOGI(TAG, "SENSOR temperature:%f", g_temperature);
            break;
        case 2:
            ESP_LOGI(TAG, "SENSOR humidity:%f", g_humidity);
            break;
        case 3:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f", g_temperature, g_humidity);
            break;
        case 4:
            ESP_LOGI(TAG, "SENSOR pressure:%f", g_pressure);
            break;
        case 5:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f", g_temperature, g_pressure);
            break;
        case 6:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f", g_humidity, g_pressure);
            break;
        case 7:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f", g_temperature, g_humidity, g_pressure);
            break;
        case 8:
            ESP_LOGI(TAG, "SENSOR CO2:%d", g_co2);
            break;
        case 9:
            ESP_LOGI(TAG, "SENSOR temperature:%f CO2:%d", g_temperature, g_co2);
            break;
        case 10:
            ESP_LOGI(TAG, "SENSOR humidity:%f CO2:%d", g_humidity, g_co2);
            break;
        case 11:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f CO2:%d", g_temperature, g_humidity, g_co2);
            break;
        case 12:
            ESP_LOGI(TAG, "SENSOR pressure:%f CO2:%d", g_pressure, g_co2);
            break;
        case 13:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f CO2:%d", g_temperature, g_pressure, g_co2);
            break;
        case 14:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f CO2:%d", g_humidity, g_pressure, g_co2);
            break;
        case 15:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f CO2:%d", g_temperature, g_humidity, g_pressure, g_co2);
            break;
        case 16:
            ESP_LOGI(TAG, "SENSOR lux:%u", g_lux);
            break;
        case 17:
            ESP_LOGI(TAG, "SENSOR temperature:%f lux:%u", g_temperature, g_lux);
            break;
        case 18:
            ESP_LOGI(TAG, "SENSOR humidity:%f lux:%u", g_humidity, g_lux);
            break;
        case 19:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f lux:%u", g_temperature, g_humidity, g_lux);
            break;
        case 20:
            ESP_LOGI(TAG, "SENSOR pressure:%f lux:%u", g_pressure, g_lux);
            break;
        case 21:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f lux:%u", g_temperature, g_pressure, g_lux);
            break;
        case 22:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f lux:%u", g_humidity, g_pressure, g_lux);
            break;
        case 23:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f lux:%u", g_temperature, g_humidity, g_pressure, g_lux);
            break;
        case 24:
            ESP_LOGI(TAG, "SENSOR CO2:%d lux:%u", g_co2, g_lux);
            break;
        case 25:
            ESP_LOGI(TAG, "SENSOR temperature:%f CO2:%d lux:%u", g_temperature, g_co2, g_lux);
            break;
        case 26:
            ESP_LOGI(TAG, "SENSOR humidity:%f CO2:%d lux:%u", g_humidity, g_co2, g_lux);
            break;
        case 27:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f CO2:%d lux:%u", g_temperature, g_humidity, g_co2, g_lux);
            break;
        case 28:
            ESP_LOGI(TAG, "SENSOR pressure:%f CO2:%d lux:%u", g_pressure, g_co2, g_lux);
            break;
        case 29:
            ESP_LOGI(TAG, "SENSOR temperature:%f pressure:%f CO2:%d lux:%u", g_temperature, g_pressure, g_co2, g_lux);
            break;
        case 30:
            ESP_LOGI(TAG, "SENSOR humidity:%f pressure:%f CO2:%d lux:%u", g_humidity, g_pressure, g_co2, g_lux);
            break;
        case 31:
            ESP_LOGI(TAG, "SENSOR temperature:%f humidity:%f pressure:%f CO2:%d lux:%u", g_temperature, g_humidity, g_pressure, g_co2, g_lux);
            break;
        default:
            break;
        }

