kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
        if (g_loopCount == UINT8_MAX)
        {
            g_loopCount = 0;
        }
        else
        {
            g_loopCount++;
        }
        ESP_LOGD(TAG, "g_loopCount = %d. MAX = %d", g_loopCount, UINT8_MAX);

        vTaskDelay( pdMS_TO_TICKS(10000) );
    }
}
#endif //(CONFIG_SOFTWARE_ESP_MQTT_SUPPORT != 1)
#endif //CONFIG_SOFTWARE_SENSOR_USE_SENSOR


#if CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT
#if CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC
static IRAM_ATTR bool cb_ledc_fade_end_event(const ledc_cb_param_t *param, void *user_arg)
{
    BaseType_t taskAwoken = pdFALSE;

    if (param->event == LEDC_FADE_END_EVT) {
        SemaphoreHandle_t counting_sem = (SemaphoreHandle_t) user_arg;
        xSemaphoreGiveFromISR(counting_sem, &taskAwoken);
    }

    return (taskAwoken == pdTRUE);
}
#endif // CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC

TaskHandle_t xExternalLED;
Led_t* led_ext1;
static void vExternal_led_task(void* pvParameters) {
    ESP_LOGD(TAG, "start EXTERNAL LED");

#if CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC
    ledc_timer_config_t ledc_timer = {
        .duty_resolution = LEDC_TIMER_13_BIT, // resolution of PWM duty
        .freq_hz = 4000,                      // frequency of PWM signal
        .speed_mode = LEDC_LS_MODE,           // timer mode
        .timer_num = LEDC_LS_TIMER,            // timer index
        .clk_cfg = LEDC_AUTO_CLK,              // Auto select the source clock
    };
    ledc_timer_config(&ledc_timer);
    ledc_channel_config_t ledc_channel = {
        .channel    = LEDC_LS_CH0_CHANNEL,
        .duty       = 0,
        .gpio_num   = LEDC_LS_CH0_GPIO,
        .speed_mode = LEDC_LS_MODE,
        .hpoint     = 0,
        .timer_sel  = LEDC_LS_TIMER,
        .flags.output_invert = 0
    };
    ledc_channel_config(&ledc_channel);

    ledc_fade_func_install(0);
    ledc_cbs_t callbacks = {
        .fade_cb = cb_ledc_fade_end_event
    };
    SemaphoreHandle_t counting_sem = xSemaphoreCreateCounting(1, 0);
    ledc_cb_register(ledc_channel.speed_mode, ledc_channel.channel, &callbacks, (void *) counting_sem);
#endif // CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC

#if CONFIG_SOFTWARE_EXTERNAL_LED_MODE_GPIO
    Led_Init();

    if (Led_Enable(LED_EXT1_GPIO_PIN) == ESP_OK) {
        led_ext1 = Led_Attach(LED_EXT1_GPIO_PIN);
    }
#endif // CONFIG_SOFTWARE_EXTERNAL_LED_MODE_GPIO
    while(1){
#if CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC
        ledc_set_fade_with_time(ledc_channel.speed_mode,
                                ledc_channel.channel, LEDC_DUTY_RESOLUTION, LEDC_FADE_TIME);
        ledc_fade_start(ledc_channel.speed_mode,
                        ledc_channel.channel, LEDC_FADE_NO_WAIT);
        xSemaphoreTake(counting_sem, portMAX_DELAY);

        ledc_set_fade_with_time(ledc_channel.speed_mode,
                                ledc_channel.channel, 0, LEDC_FADE_TIME);
        ledc_fade_start(ledc_channel.speed_mode,
                        ledc_channel.channel, LEDC_FADE_NO_WAIT);
        xSemaphoreTake(counting_sem, portMAX_DELAY);

        vTaskDelay( pdMS_TO_TICKS(1000) );
#endif // CONFIG_SOFTWARE_EXTERNAL_LED_MODE_LEDC
#if CONFIG_SOFTWARE_EXTERNAL_LED_MODE_GPIO
        Led_OnOff(led_ext1, true);
        vTaskDelay(pdMS_TO_TICKS(700));

        Led_OnOff(led_ext1, false);
        vTaskDelay(pdMS_TO_TICKS(300));
#endif // CONFIG_SOFTWARE_EXTERNAL_LED_MODE_GPIO
    }

    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_SOFTWARE_EXTERNAL_LED_SUPPORT

#if CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT
TaskHandle_t xExternalRGBLedBlink;
rmt_channel_handle_t rgb_ext1_channel = NULL;
rmt_encoder_handle_t rgb_ext1_encoder = NULL;
pixel_settings_t px_ext1;

void vExternal_RGBLedBlink_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start EXTERNAL RGBLedBlink");

    esp_err_t res = ESP_OK;
    uint8_t rgbled_count = 1;
    uint8_t blink_count = 5;

    uint32_t colors[] = {SK6812_COLOR_BLUE, SK6812_COLOR_LIME, SK6812_COLOR_AQUA
                    , SK6812_COLOR_RED, SK6812_COLOR_MAGENTA, SK6812_COLOR_YELLOW
                    , SK6812_COLOR_WHITE};

/*
    uint32_t colors[] = {
                          0xFF0000, 0xF70000, 0xEF0000, 0xE70000
                        , 0xDF0000, 0xD70000, 0xCF0000, 0xC70000
                        , 0xBF0000, 0xB70000, 0xAF0000, 0xA70000
                        , 0x9F0000, 0x970000, 0x8F0000, 0x870000
                        , 0x7F0000, 0x770000, 0x6F0000, 0x670000
                        , 0x5F0000, 0x570000, 0x4F0000, 0x470000
                        , 0x3F0000, 0x370000, 0x2F0000, 0x270000
                        , 0x1F0000, 0x170000, 0x0F0000, 0x070000 //
                        , 0x070000, 0x0F0000, 0x170000, 0x1F0000
                        , 0x270000, 0x2F0000, 0x370000, 0x3F0000
                        , 0x470000, 0x4F0000, 0x570000, 0x5F0000
                        , 0x670000, 0x6F0000, 0x770000, 0x7F0000
                        , 0x870000, 0x8F0000, 0x970000, 0x9F0000
                        , 0xA70000, 0xAF0000, 0xB70000, 0xBF0000
                        , 0xC70000, 0xCF0000, 0xD70000, 0xDF0000
                        , 0xE70000, 0xEF0000, 0xF70000, 0xFF0000
                        };
*/
    res = Sk6812_Init_Ex(&px_ext1, rgbled_count, RGBLED_EXT1_GPIO_PIN, &rgb_ext1_channel, &rgb_ext1_encoder);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Init_Ex");
	}
    res = Sk6812_Enable_Ex(&px_ext1, rgb_ext1_channel);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Enable_Ex");
	}
    if (rgb_ext1_channel == NULL || rgb_ext1_encoder == NULL) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() NULL!");
    }
    res = Sk6812_Clear_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
    if (res != ESP_OK) {
        ESP_LOGE(TAG, "vExternal_RGBLedBlink_task() Sk6812_Clear_Ex");
	}

    while (1) {
        for (uint8_t c = 0; c < sizeof(colors)/sizeof(uint32_t); c++) {
            for (uint8_t i = 0; i < blink_count; i++) {
                Sk6812_SetAllColor_Ex(&px_ext1, colors[c]);
                Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
                vTaskDelay(pdMS_TO_TICKS(1000));

                Sk6812_SetAllColor_Ex(&px_ext1, SK6812_COLOR_OFF);
                Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }
/*
        for (uint8_t c = 0; c < sizeof(colors)/sizeof(uint32_t); c++) {
//            ESP_LOGI(TAG, "Sk6812_SetAllColor_Ex %ld", colors[c]);
            Sk6812_SetAllColor_Ex(&px_ext1, colors[c]);
            Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
            vTaskDelay(pdMS_TO_TICKS(100));
        }
*/
/*
        for (uint8_t c = 255; c > 56; c--)
        {
            Sk6812_SetColorFromGRBW_Ex(&px_ext1, 0, 0, c, 0, 0);
            Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
            vTaskDelay(pdMS_TO_TICKS(30));
        }
        vTaskDelay(pdMS_TO_TICKS(500));
        for (uint8_t r = 56; r < 255; r++)
        {
            Sk6812_SetColorFromGRBW_Ex(&px_ext1, 0, 0, r, 0, 0);
            Sk6812_Show_Ex(&px_ext1, rgb_ext1_channel, rgb_ext1_encoder);
            vTaskDelay(pdMS_TO_TICKS(30));
        }

        vTaskDelay(pdMS_TO_TICKS(2000));
*/
    }
}
#endif //CONFIG_SOFTWARE_EXTERNAL_SK6812_SUPPORT

#if CONFIG_HTTPS_OTA_SUPPORT
TaskHandle_t xHttpsOta;

static void event_handler(void* arg, esp_event_base_t event_base,
                        int32_t event_id, void* event_data)
{
    if (event_base == ESP_HTTPS_OTA_EVENT) {
        switch (event_id) {
            case ESP_HTTPS_OTA_START:
                ESP_LOGI(TAG, "OTA started");
                break;
            case ESP_HTTPS_OTA_CONNECTED:
                ESP_LOGI(TAG, "Connected to server");
                break;
            case ESP_HTTPS_OTA_GET_IMG_DESC:
                ESP_LOGI(TAG, "Reading Image Description");
                break;
            case ESP_HTTPS_OTA_VERIFY_CHIP_ID:
                ESP_LOGI(TAG, "Verifying chip id of new image: %d", *(esp_chip_id_t *)event_data);
                break;
            case ESP_HTTPS_OTA_DECRYPT_CB:
                ESP_LOGI(TAG, "Callback to decrypt function");
                break;
            case ESP_HTTPS_OTA_WRITE_FLASH:
                ESP_LOGD(TAG, "Writing to flash: %d written", *(int *)event_data);
                break;
            case ESP_HTTPS_OTA_UPDATE_BOOT_PARTITION:
                ESP_LOGI(TAG, "Boot partition updated. Next Partition: %d", *(esp_partition_subtype_t *)event_data);
                break;
            case ESP_HTTPS_OTA_FINISH:
                ESP_LOGI(TAG, "OTA finish");
                break;
            case ESP_HTTPS_OTA_ABORT:
                ESP_LOGI(TAG, "OTA abort");
                break;
        }
    }
}


esp_err_t do_firmware_upgrade()
{
    esp_http_client_config_t config = {
        .url = CONFIG_HTTPS_OTA_URL,
        .crt_bundle_attach = esp_crt_bundle_attach,
//        .cert_pem = (char *)server_cert_pem_start,
    };
    esp_https_ota_config_t ota_config = {
        .http_config = &config,
    };
    esp_err_t ret = esp_https_ota(&ota_config);
    if (ret == ESP_OK) {
        esp_restart();
    } else {
        return ESP_FAIL;
    }
    return ESP_OK;
}

static void vHttpsOta_task(void* pvParameters) {
    ESP_LOGI(TAG, "start HTTPS OTA");

