kudotaka/ESP32_IDF_EnvironmentSensor/ESP32_IDF_EnvironmentSensor/main/main.c
        convertValueTo3Digit(g_temperature, temp_digit);
        convertValueTo3Digit(g_humidity, humi_digit);

        Tm1637_DisplayBitAddPoint(digitdisplay_1, 0, temp_digit[0], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 1, temp_digit[1], POINT_ON);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 2, temp_digit[2], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 3, humi_digit[0], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 4, humi_digit[1], POINT_ON);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 5, humi_digit[2], POINT_OFF);

/*        uint8_t pres_digit[4] = {0};
        convertValueTo4Digit(g_pressure, pres_digit);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 0, pres_digit[0], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 1, pres_digit[1], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 2, pres_digit[2], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 3, pres_digit[3], POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 4, 0x7f, POINT_OFF);
        Tm1637_DisplayBitAddPoint(digitdisplay_1, 5, 0x7f, POINT_OFF);
*/
        vTaskDelay(pdMS_TO_TICKS(10000));
    }
    vTaskDelete(NULL); // Should never get to here...

}
#endif //( CONFIG_SOFTWARE_ESP_MQTT_SUPPORT || CONFIG_SOFTWARE_SENSOR_USE_SENSOR )
#endif //CONFIG_SOFTWARE_EXTERNAL_6DIGIT_DISPLAY_SUPPORT

#if CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT
    // ADC
//    xTaskCreate(&vMeasureOperationVoltageTask, "vMeasureOperationVoltageTask", 4096 * 1, NULL, 2, &vMeasureOperationVoltage);
TaskHandle_t xMeasureOperationVoltage;

// ADC Calibration
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif //ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated) {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK) {
            calibrated = true;
        }
    }
#endif //ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED

    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void adc_calibration_deinit(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
#endif
}

static int orignalVoltage(int vol)
{
//    return (int)(vol / 100.0 * (100.0+270.0));
    return (int)(vol / MEASURE_OPERATION_VOLTAGE_RESISTOR2 * ( MEASURE_OPERATION_VOLTAGE_RESISTOR2 + MEASURE_OPERATION_VOLTAGE_RESISTOR1 ));
}

void vMeasureOperationVoltageTask(void *pvParametes)
{
    ESP_LOGI(TAG, "start Measure Operation Voltage");
    adc_oneshot_unit_handle_t adc_handle1;
    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = MEASURE_OPERATION_VOLTAGE_UNIT,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc_handle1));

    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = MEASURE_OPERATION_VOLTAGE_ADC_ATTEN,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc_handle1, MEASURE_OPERATION_VOLTAGE_CHANNEL, &config));

    adc_cali_handle_t adc_cali_handle1 = NULL;
    bool do_calibration1 = adc_calibration_init(MEASURE_OPERATION_VOLTAGE_UNIT, MEASURE_OPERATION_VOLTAGE_CHANNEL, MEASURE_OPERATION_VOLTAGE_ADC_ATTEN, &adc_cali_handle1);

    while(1) {
        ESP_ERROR_CHECK(adc_oneshot_read(adc_handle1, MEASURE_OPERATION_VOLTAGE_CHANNEL, &g_adc_raw));
//        ESP_LOGI(TAG, "ADC%d Channel[%d] Raw Data: %d", MEASURE_OPERATION_VOLTAGE_UNIT + 1, MEASURE_OPERATION_VOLTAGE_CHANNEL, g_adc_raw);
        if (do_calibration1) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc_cali_handle1, g_adc_raw, &g_voltage));
            ESP_LOGI(TAG, "VOLTAGE ADC%d_CH%d Cali Voltage: %dmV, Operation Voltage: %dmV", MEASURE_OPERATION_VOLTAGE_UNIT + 1, MEASURE_OPERATION_VOLTAGE_CHANNEL, g_voltage, orignalVoltage(g_voltage));
        }
        vTaskDelay(pdMS_TO_TICKS(10000));
    }

    ESP_ERROR_CHECK(adc_oneshot_del_unit(adc_handle1));
    if (do_calibration1) {
        adc_calibration_deinit(adc_cali_handle1);
    }

    vTaskDelete(NULL); // Should never get to here...
}
#endif //CONFIG_MEASURE_OPERATION_VOLTAGE_SUPPORT

#if CONFIG_SOFTWARE_ESP_HTTP_CLIENT_SUPPORT
esp_http_client_handle_t espHttpClient = NULL;
esp_err_t _http_event_handler(esp_http_client_event_t *evt)
{
    static char *output_buffer;  // Buffer to store response of http request from event handler
    static int output_len;       // Stores number of bytes read
    switch(evt->event_id) {
        case HTTP_EVENT_ERROR:
            ESP_LOGD(TAG, "HTTP_EVENT_ERROR");
            break;
        case HTTP_EVENT_ON_CONNECTED:
            ESP_LOGD(TAG, "HTTP_EVENT_ON_CONNECTED");
            break;
        case HTTP_EVENT_HEADER_SENT:
            ESP_LOGD(TAG, "HTTP_EVENT_HEADER_SENT");
            break;
        case HTTP_EVENT_ON_HEADER:
            ESP_LOGD(TAG, "HTTP_EVENT_ON_HEADER, key=%s, value=%s", evt->header_key, evt->header_value);
            break;
        case HTTP_EVENT_ON_DATA:
            ESP_LOGD(TAG, "HTTP_EVENT_ON_DATA, len=%d", evt->data_len);
            // Clean the buffer in case of a new request
            if (output_len == 0 && evt->user_data) {
                // we are just starting to copy the output data into the use
                memset(evt->user_data, 0, MAX_HTTP_OUTPUT_BUFFER);
            }
            /*
             *  Check for chunked encoding is added as the URL for chunked encoding used in this example returns binary data.
             *  However, event handler can also be used in case chunked encoding is used.
             */
            if (!esp_http_client_is_chunked_response(evt->client)) {
                // If user_data buffer is configured, copy the response into the buffer
                int copy_len = 0;
                if (evt->user_data) {
                    // The last byte in evt->user_data is kept for the NULL character in case of out-of-bound access.
                    copy_len = MIN(evt->data_len, (MAX_HTTP_OUTPUT_BUFFER - output_len));
                    if (copy_len) {
                        memcpy(evt->user_data + output_len, evt->data, copy_len);
                    }
                } else {
                    int content_len = esp_http_client_get_content_length(evt->client);
                    if (output_buffer == NULL) {
                        // We initialize output_buffer with 0 because it is used by strlen() and similar functions therefore should be null terminated.
                        output_buffer = (char *) calloc(content_len + 1, sizeof(char));
                        output_len = 0;
                        if (output_buffer == NULL) {
                            ESP_LOGE(TAG, "Failed to allocate memory for output buffer");
                            return ESP_FAIL;
                        }
                    }
                    copy_len = MIN(evt->data_len, (content_len - output_len));
                    if (copy_len) {
                        memcpy(output_buffer + output_len, evt->data, copy_len);
                    }
                }
                output_len += copy_len;
            }

            break;
        case HTTP_EVENT_ON_FINISH:
            ESP_LOGD(TAG, "HTTP_EVENT_ON_FINISH");
            if (output_buffer != NULL) {
#if CONFIG_EXAMPLE_ENABLE_RESPONSE_BUFFER_DUMP
                ESP_LOG_BUFFER_HEX(TAG, output_buffer, output_len);
#endif
                free(output_buffer);
                output_buffer = NULL;
            }
            output_len = 0;
            break;
        case HTTP_EVENT_DISCONNECTED:
            ESP_LOGI(TAG, "HTTP_EVENT_DISCONNECTED");
            esp_err_t err = esp_http_client_get_errno((esp_http_client_handle_t)evt->client);
            if (err != 0) {
                ESP_LOGI(TAG, "Last esp error code: 0x%x", err);
            }
            if (output_buffer != NULL) {
                free(output_buffer);
                output_buffer = NULL;
            }
            output_len = 0;
            break;
        case HTTP_EVENT_REDIRECT:
            ESP_LOGD(TAG, "HTTP_EVENT_REDIRECT");
            esp_http_client_set_header(evt->client, "From", "user@example.com");
            esp_http_client_set_header(evt->client, "Accept", "text/html");
            esp_http_client_set_redirection(evt->client);
            break;
    }
    return ESP_OK;
}

static void pushgateway_app_start(void)
{
    esp_http_client_config_t config = {
        .host = CONFIG_PUSHGATEWAY_HTTP_HOST,
        .port = CONFIG_PUSHGATEWAY_HTTP_PORT,
        .path = CONFIG_PUSHGATEWAY_METRIC_URL,
        .event_handler = _http_event_handler,
        .transport_type = HTTP_TRANSPORT_OVER_TCP,
        .disable_auto_redirect = true,
    };

    ESP_LOGI(TAG, "host:%s path:%s port:%d", config.host, config.path, config.port);
    espHttpClient = esp_http_client_init(&config);
    if (espHttpClient == NULL) {
        ESP_LOGE(TAG, "esp_http_client_init() is error.");
        return;
    }
}

static void pushgateway_app_stop(void)
{
    ESP_ERROR_CHECK(esp_http_client_cleanup(espHttpClient));
    if (espHttpClient != NULL) {
        espHttpClient = NULL;
    }
}

void pushgateway_main()
{
    // connected wifi
    if (wifi_isConnected() != ESP_OK) {
        return;
    }
    if (espHttpClient == NULL) {
        pushgateway_app_start();
    }

    esp_err_t err = ESP_OK;
    char dataMessage[256] = {0};
    ESP_LOGD(TAG, "SENSOR mode %d", g_sensor_mode);

    switch (g_sensor_mode)
    {
    case 1:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n", g_temperature);
        break;
    case 2:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n", g_humidity);
        break;
    case 3:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n}", g_temperature, g_humidity);
        break;
    case 4:
        sprintf(dataMessage, "# TYPE pressure\npressure %4.1f\n", g_pressure);
        break;
    case 5:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE pressure\npressure %4.1f\n", g_temperature, g_pressure);
        break;
    case 6:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n", g_humidity, g_pressure);
        break;
    case 7:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n", g_temperature, g_humidity, g_pressure);
        break;
    case 8:
        sprintf(dataMessage, "# TYPE co2\nco2 %4d\n", g_co2);
        break;
    case 9:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE co2\nco2 %4d\n", g_temperature, g_co2);
        break;
    case 10:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE co2\nco2 %4d\n", g_humidity, g_co2);
        break;
    case 11:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE co2\nco2 %4d\n", g_temperature, g_humidity, g_co2);
        break;
    case 12:
        sprintf(dataMessage, "# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n", g_pressure, g_co2);
        break;
    case 13:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n", g_temperature, g_pressure, g_co2);
        break;
    case 14:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n", g_humidity, g_pressure, g_co2);
        break;
    case 15:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n", g_temperature, g_humidity, g_pressure, g_co2);
        break;
    case 16:
        sprintf(dataMessage, "# TYPE lux\nlux %5u\n", g_lux);
        break;
    case 17:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE lux\nlux %5u\n", g_temperature, g_lux);
        break;
    case 18:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE lux\nlux %5u\n", g_humidity, g_lux);
        break;
    case 19:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE lux\nlux %5u\n", g_temperature, g_humidity, g_lux);
        break;
    case 20:
        sprintf(dataMessage, "# TYPE pressure\npressure %4.1f\n# TYPE lux\nlux %5u\n", g_pressure, g_lux);
        break;
    case 21:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE lux\nlux %5u\n", g_temperature, g_pressure, g_lux);
        break;
    case 22:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE lux\nlux %5u\n", g_humidity, g_pressure, g_lux);
        break;
    case 23:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE lux\nlux %5u\n", g_temperature, g_humidity, g_pressure, g_lux);
        break;
    case 24:
        sprintf(dataMessage, "# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_co2, g_lux);
        break;
    case 25:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_temperature, g_co2, g_lux);
        break;
    case 26:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_humidity, g_co2, g_lux);
        break;
    case 27:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_temperature, g_humidity, g_co2, g_lux);
        break;
    case 28:
        sprintf(dataMessage, "# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_pressure, g_co2, g_lux);
        break;
    case 29:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_temperature, g_pressure, g_co2, g_lux);
        break;
    case 30:
        sprintf(dataMessage, "# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_humidity, g_pressure, g_co2, g_lux);
        break;
    case 31:
        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n# TYPE pressure\npressure %4.1f\n# TYPE co2\nco2 %4d\n# TYPE lux\nlux %5u\n", g_temperature, g_humidity, g_pressure, g_co2, g_lux);
        break;
    default:
        break;
    }

    // POST
//        sprintf(dataMessage, "# TYPE temperature\ntemperature %4.1f\n# TYPE humidity\nhumidity %4.1f\n", g_temperature, g_humidity);

    ESP_ERROR_CHECK( esp_http_client_set_method(espHttpClient, HTTP_METHOD_POST) );
    ESP_ERROR_CHECK( esp_http_client_set_post_field(espHttpClient, dataMessage, strlen(dataMessage)) );
    err = esp_http_client_perform(espHttpClient);
    if (err == ESP_OK) {
        ESP_LOGI(TAG, "messenge:\n%s", dataMessage);
        ESP_LOGI(TAG, "HTTP POST Status = %d, content_length = %"PRId64, 
                esp_http_client_get_status_code(espHttpClient),
                esp_http_client_get_content_length(espHttpClient));
    } else {
        ESP_LOGE(TAG, "HTTP POST request failed: %s", esp_err_to_name(err));
    }

    pushgateway_app_stop();
}

TaskHandle_t xPushgateway;
void vPushgateway_task(void *pvParametes)
{
    ESP_LOGD(TAG, "start Pushgateway");
    vTaskDelay( pdMS_TO_TICKS(10000) );

    while (1) {
        pushgateway_main();

        vTaskDelay( pdMS_TO_TICKS(20000) );
    }
}
#endif //CONFIG_SOFTWARE_ESP_HTTP_CLIENT_SUPPORT

////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
void app_main(void)
{
    ESP_LOGI(TAG, "app_main() start.");
    esp_log_level_set("*", ESP_LOG_ERROR);
    esp_log_level_set("MY-MAIN", ESP_LOG_DEBUG);
    esp_log_level_set("MY-WIFI", ESP_LOG_INFO);
    esp_log_level_set("MY-HT16K33", ESP_LOG_INFO);


#if CONFIG_SOFTWARE_UI_SUPPORT
    ui_init();
#endif //CONFIG_SOFTWARE_UI_SUPPORT

